{
    "name": "Access",
    "description": "# Tutorials and Guides\n- The JavaScript tutorial: [https://github.com/tradovate/example-api-js](https://github.com/tradovate/example-api-js)\n- C# API and WebSocket guide: [https://github.com/tradovate/example-api-csharp-trading](https://github.com/tradovate/example-api-csharp-trading)\n- JavaScript OAuth guide: [https://github.com/tradovate/example-api-oauth](https://github.com/tradovate/example-api-oauth)\n- API FAQ and code samples: [https://github.com/tradovate/example-api-faq](https://github.com/tradovate/example-api-faq)\n\n# Directly Accessing the REST API\nUsers can access the API by using client libraries, by making REST requests, or by establishing a WebSocket connection. If you'd like to follow\nalong with our comprehensive **JavaScript guide to the Tradovate API**, you can find it [here](https://github.com/tradovate/example-api-js). \n\n[Follow along with this document to gain access to the API.](https://community.tradovate.com/t/how-do-i-access-the-api/2380)\n\nTo access a server, you need to know the location of the server and have credentials to access it. Typically, credentials are automatically set-up when \nyou open a demo account via signup process of regular Tradovate web-site or an application. You can also gain access to the Tradovate servers by \ndelegating authentication to [OAuth](https://github.com/tradovate/example-api-oauth).\n\nThe domains of the API services are split up based on what service each provides. You can use the server that corresponds to the service that you need:\n\n- `live.tradovateapi.com` for Live only functionality.\n- `demo.tradovateapi.com` for simulation engine.\n- `md.tradovateapi.com` and for a market data feed.\n\nWe support a relaxed REST API. We recommend using `GET` or `POST` methods based on the particular endpoints you'd like to access,\nbut do not enforce the request method you use. It is generally the case that if you need to send a JSON body with your request it should be a `POST`,\nwhile requests that require no body can use the `GET` method. All responses from the Tradovate REST API are in JSON format.\n\n# Access Tokens\nBefore a client can access a protected resource, that client must obtain an access token. To do so, a client can directly exchange its own credentials to\nfor an access token, it can use a social login via Google or Facebook, or it can delegate the authentication process to the OAuth service.\n\nIn order to use the access token, the client uses the \"Bearer\" authentication scheme to transmit the access token in \"Authorization\" request header field.\n\n# Get An Access Token Using Client Credentials\n\nIn cURL:\n\n```curl\ncurl -X POST https://demo.tradovateapi.com/v1/auth/accesstokenrequest\n\t -H \"Content-Type: application/json\" \n     -H \"Accept: application/json\"\n     -d \"{\n          \\\"name\\\": \\\"your credentials here\\\",\n          \\\"password\\\": \\\"your credentials here\\\",\n          \\\"appId\\\": \\\"Sample App\\\",\n          \\\"appVersion\\\": \\\"1.0\\\",\n          \\\"cid\\\": 8,          \n          \\\"deviceId\\\": \\\"123e4567-e89b-12d3-a456-426614174000\\\",\n          \\\"sec\\\": \\\"f03741b6-f634-48d6-9308-c8fb871150c2\\\"\n     \t}\"\n\n# returns:\n\n{\n    \"accessToken\": <your access token response here>,\n    \"mdAccessToken\": <your md access token response here>,\n    \"expirationTime\": \"2021-06-15T15:40:30.056Z\",\n    \"userStatus\": \"Active\",\n    \"userId\": 15460,\n    \"name\": \"alennert02\",\n    \"hasLive\": true,\n    \"outdatedTaC\": false,\n    \"hasFunded\": true,\n    \"hasMarketData\": true,\n    \"outdatedLiquidationPolicy\": false\n}\n```\n...or in JavaScript:\n\n```js\nconst body = {\n    name:       \"<replace with your credentials>\",\n    password:   \"<replace with your credentials>\",\n    appId:      \"Sample App\",\n    appVersion: \"1.0\",\n    cid:        8,\n    sec:        \"f03741b6-f634-48d6-9308-c8fb871150c2\",\n    deviceId:   \"123e4567-e89b-12d3-a456-426614174000\"\n}\n\nconst response = await fetch('https://live.tradovateapi.com/v1/auth/accesstokenrequest', {\n    method: 'POST',\n    mode: 'cors',\n    headers: {\n        'Content-Type': 'application/json',\n        'Accept': 'application/json',\n    },\n    body: JSON.stringify(body)\n})\n\nconst json = await response.json()\n```\n\nThe client can use the access token until it expires. Your access token's expiry is sent in the JSON response in the `expirationTime` field.\n\n**[Try it!](/#operation/accessTokenRequest)**\n\n# Two-Factor Authentication\nIn order to enable two factor authentication for your application, you will need to supply three special fields in the JSON body of your\naccess token request:\n\n- `deviceId` is a string up to 64 characters that uniquely and permanently identify the physical device. For example, the app can use https://github.com/MatthewKing/DeviceId package to get an id for C#, or use a package like [device-uuid](https://www.npmjs.com/package/device-uuid) for JS. Please note that it is up to the developer to supply this functionality, we offer no built-in solution to identify a device using the Tradovate API.\n- `cid` is a client app id  provided by Tradovate. \n- `sec` is a secret (or API key) provided by Tradovate. This key should be kept away from public access - don't include the file you keep your key in on GitHub if you keep your code in the public realm.\n\nUnlike `cid`, the `appId` and `appVersion` fields are app identifiers in free form that can be displayed to the end-users in Tradovate Trader UI to show what apps are connected.\n\n> NOTE: **Use Two-Factor Authentication!** Remember that this is yours or your client's money and identity at stake,\n> and two factor authentication is an industry standard in the world of financial technology. Don't take risks with your clients' credentials.\n\n# OAuth\nThe Tradovate API supports authentication via OAuth as well. For an example on how to use OAuth to access the API see [this tutorial](https://github.com/tradovate/example-api-oauth).\n\n# Using Your Access Token\nIn order to access the REST API endpoints, your requests will need to follow the Bearer authentication schema. We can do so by setting the Authorization\nheader. Below, in cURL:\n\n```\ncurl -X GET --header 'Accept: application/json' --header 'Authorization: Bearer ag_8a97la5-T6PqMfUhu-NReEUxW4cFq_dxw-jx6SUWeqqgF6YQ5BIRZK7-rKl0zxXeOUWAYpSZLzFsv11sNlMVza1NDGuKETtTCayV7oIhWpsmg7KSpidMYPBg_J05rC_9vobaw-jA1JuCgrlman_L5G2KCl0choVttLNw' 'https://live.tradovateapi.com/v1/account/list'\n\n[\n  {\n    \"id\": 33,\n    \"name\": \"X0314\",\n    \"userId\": 90,\n    \"accountType\": \"Customer\",\n    \"active\": true,\n    \"clearingHouseId\": 1,\n    \"riskCategoryId\": 5,\n    \"autoLiqProfileId\": 1,\n    \"marginAccountType\": \"Speculator\",\n    \"legalStatus\": \"Individual\"\n  }\n]\n```\n\n...or in JavaScript:\n\n```js\nconst response = await fetch('https://live.tradovateapi.com/v1/account/list', {\n    method: 'GET',\n    headers: {\n        'Authorization': `Bearer ${my_access_token_here}`, //<-- your token, provided following the Bearer schema\n        'Content-Type': 'application/json',\n        'Accept': 'application/json'\n    }\n})\n\nconst json = await response.json()\n```\n\n**[Try it!](/#operation/accountList)**\n\n> Note: currently, social logins are not allowed for customers with live accounts.\n\n# Streaming via WebSocket\nWebSockets make it possible to open an interactive communication session. This means you can receive and respond to data in real time and synchronize\nyour users' experiences. With this API, you can send messages to a server and receive event-driven responses without having to poll the server for a reply.\nOur protocol over WebSocket uses the same semantics for requests as the REST API, but tailored to fit the JSON format expected by the standard WebSocket\nprotocol. We describe the WebSocket protocol in further detail [here](/#tag/WebSockets).\n\n# Request Rate Limits And Time Penalty\nTo prevent things like DDoS attacks, we limit request rates and impose time penalties when certain thresholds are triggered. There are request limits on the hour, minute, and second intervals. As soon as a limit reached, our server stops handling requests for a period of time and responds to each new request with 429 status code, 'Too Many Requests'. Generally, the limits are high enough not to hit them during normal operations.\n\nNovel operations that are known to be called infrequently have further constraints placed upon them. These operations include requesting an access token, \nsigning up for an account, changing a password, or changing contact information. These operations are not intended for frequent use. If a client\nreaches one of these limits, a special time-penalty response will be issued. This response is a JSON object with the fields `\"p-ticket\"` and `\"p-time\"`. \nIf you receive this response, it means that the request was not handled and the server imposed a time penalty on that request. The client can retry the call in `\"p-time\"` seconds and should include `\"p-ticket\"` as an additional parameter in the request body's JSON. Additional to this, there is a field called `\"p-captcha\"`. When this field is marked `true`, it means the operation that failed cannot be tried again from a third party application and users should be alerted that they should try the operation again in an hour. One time this can occur is upon too many authentication requests with sent bad data (incorrect username or password).\n\nThere is more information available on rate limits in the [API FAQ](https://github.com/tradovate/example-api-faq).\n\n# Connection limits\nWe have a limit for a number of one simultaneous client connection per customer. Multiple simultaneous connections are supported by subscription, see the Application Settings > Connections section of the Trader application for details about simultaneous connection allowances and pricing.\nWhen a customer reaches their limit of connections, the server will disconnect the oldest ones.\n\n# Account Risk Status\nAt Tradovate, we auto-liquidate accounts that have fallen below a health set of criteria. You can view our full liquidation policy [here](https://tradovate.com/liquidation-policy/). The easiest way to retrieve information about an account's current liquidation status is by using the [`/accountRiskStatus/list`](#operation/accountRiskStatusList) operation. This endpoint will retrieve the liquidation statuses for the calling account. This endpoint will show you your current status as `adminAction`, timestamps for your last auto-liquidation period and the time of review, a reason code for the action taken, and an auto-liquidation counter to track the number of times this account has been auto-liquidated. \n\nTo protect yourself from falling into auto-liquidation status, we offer a variety of risk management services which you can access and modify using the Tradovate REST API. If you're familiar with trading using the Trader application, you may already know about our available Risk Limits. Take a look at the [Risks](#tag/Risks) section of the API documentation. Some of the possible ways you can limit your risk include:\n\n- Position limits (limit how much you can trade),\n- Product limitations (limit what you can trade),\n- Daily/Weekly loss limits,\n- Trailing max drawdown (more info [here](https://tradovate.zendesk.com/hc/en-us/articles/360035269274-How-do-I-set-a-Trailing-Max-Drawdown-on-my-account-))\n\nYou can easily query your current Risk Limits using the [`/userAccountPositionLimit/deps`](#operation/userAccountPositionLimitDependents) or [`/userAccountPositionLimit/ldeps`](#operation/userAccountPositionLimitLDependents) endpoints, supplying your account ID as a query parameter. This will return a list of `UserAccountPositionLimit` entities. Note the IDs of these items, because we can use them to get the actual parameters paired with\nthese risk limits.\n> *Note*: Your account ID is not the 'LIVE12345' or 'DEMO12345' strings, it is the actual integer entity ID. You can retrieve your account(s) information by using the  [`/account/list`](#operation/accountList) operation. The `id` field is the real entity ID of an account.\n\nTo get the related Risk Parameter entities (the actual values that get set by Risk Limits), we can use the [`/userAccountRiskParameter/deps`](#operation/userAccountRiskParameterDependents) operation. This will return all the related parameters to the given `UserAccountPositionLimit` entity. If you have placed a limit on products that you can trade, you'll see references to those products in the `productId` field of the response object. If the limit isn't on products, you'll get different parameters. For example, if you've set a hard position limit of 30 open contracts, you'll receive a Risk Parameter object that looks like this:\n\n```js\n[\n    {\n        \"id\": 20745,\n        \"hardLimit\": true,\n        \"userAccountPositionLimitId\": 17180\n    }\n]\n```\n\nTo set your own risk limits via the API, you need to use a combination of both the [`/userAccountPositionLimit/create`](#operation/userAccountPositionLimitCreate) and [`/userAccountRiskParameter/create`](#operation/userAccountRiskParameterCreate) endpoints. First you need to create a Position Limit entity, and then you must parameterize it using a Risk Parameter entity.\n\nAs an example, let's say you want to limit your maximum allowed position to 30 open contracts. To do so we will create a new Position Limit entity and parameterize it with an appropriate Risk Parameter entity:\n\n```js\nconst URL = 'https://demo.tradovateapi.com/v1'\n\nconst posLimitBody = {\n    accountId: myAccountId,\n    active: true,\n    totalBy: 'Overall',\n    exposedLimit: 30, //this is max open contracts amount\n    description: 'Max Position Size',\n}\n\nconst posLimitRes = await fetch(URL + '/userAccountPositionLimit/create', {\n    method: 'POST',\n    headers: {\n        'Content-Type': 'application/json',\n        'Accept': 'application/json',\n        'Authorization': `Bearer ${myAccessToken}`\n    },\n    body: JSON.stringify(posLimitBody)\n})\n\nconst { id } = await posLimitRes.json()\n\nconst riskParamBody = {\n    hardLimit: true,\n    userAccountPositionLimitId: id\n}\n\nconst riskParamRes = await fetch(URL + '/userAccountRiskParameter/create', {\n    method: 'POST',\n    headers: {\n        'Content-Type': 'application/json',\n        'Accept': 'application/json',\n        'Authorization': `Bearer ${myAccessToken}`\n    },\n    body: JSON.stringify(riskParamBody)\n})\n\nconst riskParams = await riskParamRes.json()\n```"
}